## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 5 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                 RESOURCE                                  |
|----------|---------------------------------------------------------------------------|
| add      | `aws_security_group_rule.superset_redis_ingress_ecs`                      |
| update   | `aws_elasticache_cluster.superset`                                        |
|          | `aws_security_group.superset_redis`                                       |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                             |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                           |
|          | `module.superset_ecs.aws_ecs_service.this`                                |
| recreate | `aws_ecs_task_definition.superset_upgrade`                                |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`                     |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                   |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                        |
| delete   | `module.superset-redis.aws_security_group_rule.ingress_sgs_access[&quot;app&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:36" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                      ~ {
                            name  = "REDIS_HOST"
                          - value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name             = "superset-upgrade"
                    # (12 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 36 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elasticache_cluster.superset will be updated in-place
  # (moved from module.superset-redis.aws_elasticache_cluster.default)
  ~ resource "aws_elasticache_cluster" "superset" {
        id                         = "cds-redis"
      ~ tags                       = {
            "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-cluster" -> null
            "Terraform"  = "true"
          - "module"     = "elastic-cache" -> null
        }
      ~ tags_all                   = {
          - "Name"       = "cds-cluster" -> null
          - "module"     = "elastic-cache" -> null
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)
    }

  # module.superset-redis.aws_elasticache_subnet_group.default has moved to aws_elasticache_subnet_group.superset
    resource "aws_elasticache_subnet_group" "superset" {
        id          = "cds-redis-subnet-grp"
        name        = "cds-redis-subnet-grp"
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.superset_redis will be updated in-place
  # (moved from module.superset-redis.aws_security_group.default)
  ~ resource "aws_security_group" "superset_redis" {
        id                     = "sg-0e8762da76bf122d9"
        name                   = "cds-redis-sg"
      ~ tags                   = {
            "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-sg" -> null
            "Terraform"  = "true"
          - "module"     = "elastic-cache" -> null
        }
      ~ tags_all               = {
          - "Name"       = "cds-sg" -> null
          - "module"     = "elastic-cache" -> null
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.superset_redis_ingress_ecs will be created
  + resource "aws_security_group_rule" "superset_redis_ingress_ecs" {
      + description              = "Ingress from Superset ECS task to redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e8762da76bf122d9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-038e16631d49d3f69"
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "celery-beat"
      + task_role_arn        = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:63" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:55" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                      ~ {
                            name  = "REDIS_HOST"
                          - value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name                   = "celery-beat"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 55 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "celery-worker"
      + task_role_arn        = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:64" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:56" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                      ~ {
                            name  = "REDIS_HOST"
                          - value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name                   = "celery-worker"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-worker" -> (known after apply)
      ~ revision                 = 56 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset-redis.aws_security_group_rule.ingress_sgs_access["app"] will be destroyed
  # (because aws_security_group_rule.ingress_sgs_access is not in configuration)
  - resource "aws_security_group_rule" "ingress_sgs_access" {
      - from_port                = 6379 -> null
      - id                       = "sgrule-6261545" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0e8762da76bf122d9" -> null
      - security_group_rule_id   = "sgr-0a87039fa565ad7b4" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-038e16631d49d3f69" -> null
      - to_port                  = 6379 -> null
      - type                     = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "superset"
      + task_role_arn        = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:80" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:72" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                      ~ {
                            name  = "REDIS_HOST"
                          - value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name                   = "superset"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 72 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 5 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.notify_data_export.aws_s3_bucket.this,
  on .terraform/modules/notify_data_export/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.data_export"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
